{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "meta-llama/Meta-Llama-3-8B-Instruct",
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 4,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "model.layers.8.self_attn.v_proj",
    "model.layers.0.self_attn.q_proj",
    "model.layers.9.self_attn.q_proj",
    "model.layers.15.self_attn.v_proj",
    "model.layers.14.self_attn.v_proj",
    "model.layers.1.self_attn.v_proj",
    "model.layers.8.self_attn.q_proj",
    "model.layers.18.self_attn.q_proj",
    "model.layers.12.self_attn.v_proj",
    "model.layers.2.self_attn.v_proj",
    "model.layers.3.self_attn.q_proj",
    "model.layers.6.self_attn.q_proj",
    "model.layers.10.self_attn.v_proj",
    "model.layers.19.self_attn.v_proj",
    "model.layers.2.self_attn.q_proj",
    "model.layers.3.self_attn.v_proj",
    "model.layers.18.self_attn.v_proj",
    "model.layers.11.self_attn.v_proj",
    "model.layers.15.self_attn.q_proj",
    "model.layers.19.self_attn.q_proj",
    "model.layers.12.self_attn.q_proj",
    "model.layers.1.self_attn.q_proj",
    "model.layers.17.self_attn.v_proj",
    "model.layers.6.self_attn.v_proj",
    "model.layers.14.self_attn.q_proj",
    "model.layers.16.self_attn.v_proj",
    "model.layers.4.self_attn.v_proj",
    "model.layers.5.self_attn.q_proj",
    "model.layers.16.self_attn.q_proj",
    "model.layers.7.self_attn.q_proj",
    "model.layers.13.self_attn.v_proj",
    "model.layers.10.self_attn.q_proj",
    "model.layers.5.self_attn.v_proj",
    "model.layers.4.self_attn.q_proj",
    "model.layers.11.self_attn.q_proj",
    "model.layers.9.self_attn.v_proj",
    "model.layers.13.self_attn.q_proj",
    "model.layers.7.self_attn.v_proj",
    "model.layers.17.self_attn.q_proj",
    "model.layers.0.self_attn.v_proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}