{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "meta-llama/Meta-Llama-3-8B",
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 4,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "model.layers.20.self_attn.v_proj",
    "model.layers.20.self_attn.q_proj",
    "model.layers.21.self_attn.v_proj",
    "model.layers.25.self_attn.v_proj",
    "model.layers.24.self_attn.v_proj",
    "model.layers.28.self_attn.q_proj",
    "model.layers.25.self_attn.q_proj",
    "model.layers.22.self_attn.v_proj",
    "model.layers.23.self_attn.v_proj",
    "model.layers.26.self_attn.q_proj",
    "model.layers.31.self_attn.v_proj",
    "model.layers.29.self_attn.q_proj",
    "model.layers.28.self_attn.v_proj",
    "model.layers.30.self_attn.v_proj",
    "model.layers.26.self_attn.v_proj",
    "model.layers.29.self_attn.v_proj",
    "model.layers.27.self_attn.v_proj",
    "model.layers.24.self_attn.q_proj",
    "model.layers.30.self_attn.q_proj",
    "model.layers.22.self_attn.q_proj",
    "model.layers.23.self_attn.q_proj",
    "model.layers.21.self_attn.q_proj",
    "model.layers.31.self_attn.q_proj",
    "model.layers.27.self_attn.q_proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}